k6/update/smoke.log
$ k6 run smoke.js

          /\      |‾‾| /‾‾/   /‾‾/
     /\  /  \     |  |/  /   /  /
    /  \/    \    |     (   /   ‾‾\
   /          \   |  |\  \ |  (‾)  |
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: smoke.js
     output: -

  scenarios: (100.00%) 1 scenario, 1 max VUs, 40s max duration (incl. graceful stop):
           * default: 1 looping VUs for 10s (gracefulStop: 30s)


running (10.0s), 0/1 VUs, 806 complete and 0 interrupted iterations
default ✓ [======================================] 1 VUs  10s

     ✓ logged in successfully
     ✓ update member

     checks.........................: 100.00% ✓ 1612       ✗ 0
     data_received..................: 333 kB  33 kB/s
     data_sent......................: 529 kB  53 kB/s
     http_req_blocked...............: avg=7.09µs  min=3.82µs  med=4.46µs  max=3.78ms   p(90)=5.23µs   p(95)=5.7µs
     http_req_connecting............: avg=315ns   min=0s      med=0s      max=509.07µs p(90)=0s       p(95)=0s
   ✓ http_req_duration..............: avg=6.05ms  min=4.74ms  med=5.89ms  max=51.83ms  p(90)=6.82ms   p(95)=7.76ms
       { expected_response:true }...: avg=6.05ms  min=4.74ms  med=5.89ms  max=51.83ms  p(90)=6.82ms   p(95)=7.76ms
     http_req_failed................: 0.00%   ✓ 0          ✗ 1612
     http_req_receiving.............: avg=85.25µs min=24.11µs med=58.61µs max=4.33ms   p(90)=130.85µs p(95)=152.45µs
     http_req_sending...............: avg=20.3µs  min=13.53µs med=16.75µs max=458.17µs p(90)=28.42µs  p(95)=30.44µs
     http_req_tls_handshaking.......: avg=0s      min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s
     http_req_waiting...............: avg=5.95ms  min=4.65ms  med=5.83ms  max=51.74ms  p(90)=6.72ms   p(95)=7.6ms
     http_reqs......................: 1612    160.977546/s
     iteration_duration.............: avg=12.41ms min=10.69ms med=11.8ms  max=71ms     p(90)=13.89ms  p(95)=15.85ms
     iterations.....................: 806     80.488773/s
     vus............................: 1       min=1        max=1
     vus_max........................: 1       min=1        max=1