k6/update/stress-fail.log
          /\      |‾‾| /‾‾/   /‾‾/
     /\  /  \     |  |/  /   /  /
    /  \/    \    |     (   /   ‾‾\
   /          \   |  |\  \ |  (‾)  |
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: stress.js
     output: -

  scenarios: (100.00%) 1 scenario, 1900 max VUs, 7m0s max duration (incl. graceful stop):
           * default: Up to 1900 looping VUs for 6m30s over 9 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (6m30.6s), 0000/1900 VUs, 148025 complete and 0 interrupted iterations
default ✓ [======================================] 0000/1900 VUs  6m30s

     ✓ logged in successfully
     ✓ updated member

     checks.........................: 100.00% ✓ 296050    ✗ 0
     data_received..................: 61 MB   156 kB/s
     data_sent......................: 59 MB   152 kB/s
     http_req_blocked...............: avg=3.09ms   min=2.44µs  med=2.68µs   max=2.39s p(90)=2.85µs   p(95)=3.14µs
     http_req_connecting............: avg=1.4ms    min=0s      med=0s       max=1.8s  p(90)=0s       p(95)=0s
   ✗ http_req_duration..............: avg=459.11ms min=12.11µs med=390.73ms max=2.67s p(90)=1.02s    p(95)=1.16s
       { expected_response:true }...: avg=459.11ms min=12.11µs med=390.73ms max=2.67s p(90)=1.02s    p(95)=1.16s
     http_req_failed................: 0.00%   ✓ 0         ✗ 296050
     http_req_receiving.............: avg=41.52ms  min=12.11µs med=11.36ms  max=2.06s p(90)=117.74ms p(95)=164.29ms
     http_req_sending...............: avg=14.76ms  min=0s      med=58.9µs   max=2.06s p(90)=2.96ms   p(95)=59.07ms
     http_req_tls_handshaking.......: avg=1.41ms   min=0s      med=0s       max=2.11s p(90)=0s       p(95)=0s
     http_req_waiting...............: avg=402.83ms min=0s      med=322.45ms max=2.44s p(90)=941.01ms p(95)=1.07s
     http_reqs......................: 296050  757.9457/s
     iteration_duration.............: avg=2.38s    min=1s      med=2.25s    max=6.3s  p(90)=3.84s    p(95)=4.18s
     iterations.....................: 148025  378.97285/s
     vus............................: 29      min=4       max=1900
     vus_max........................: 1900    min=1900    max=1900